{
  "jobs": [
    {
      "id": "fd8c3b7c-ccfe-4cc1-882c-ef9c0522903e",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/fd8c3b7c-ccfe-4cc1-882c-ef9c0522903e",
      "created_at": "Thu Jul 30 12:13:55 UTC 2020",
      "company": "HBM nCode Federal LLC",
      "company_url": "http://www.hbmprenscia.com",
      "location": "Starkville, MS",
      "title": "Software Engineer",
      "description": "<p>HBM nCode Federal LLC/Prenscia Engineering Solutions is looking for a talented Software Engineer to join our fast growing team in our Starkville, MS office. You will be joining an active, dynamic and growing software design, development and configuration team to rapidly create innovative digital software solutions. This includes working with a team alongside subject matter experts, project managers and product managers to deliver innovative solutions using the latest technology and approaches.</p>\n<p>RESPONSIBILITIES:</p>\n<ul>\n<li>Software product configuration, design and implementation</li>\n<li>Assist the principal software engineer in collaborating with our Subject Matter Experts to understand and convert user requirements into digital design solutions based on customer (and market) needs</li>\n<li>Create detailed documentation for digital solutions, custom solutions and products and assist in customer and partner implementations</li>\n<li>Collaborate with our wider organizational software development and configuration teams to share lessons learned regarding these activities to help future solutions and software products plus ensure consistency</li>\n<li>Work with project and product managers to achieve on-time, on-cost delivery</li>\n<li>Research and test new technologies and software plus identify and recommend their applicability</li>\n<li>Presentations to team members, management and customers</li>\n</ul>\n<p>EDUCATION / CERTIFICATIONS:</p>\n<ul>\n<li>A Bachelor or Master’s degree in Computer Engineering or Computer Science with an engineering background.</li>\n<li>A minimum of 3 years of relevant experience and related technology professional certifications</li>\n</ul>\n<p>PERSONAL SKILLS/EXPERIENCES:</p>\n<ul>\n<li>US Citizens Only (REQUIREMENT)</li>\n<li>Solid understanding of Object Oriented Programming</li>\n<li>Solid understanding of modern Web based Programming techniques</li>\n<li>Experience with database architectures, scripting and web services</li>\n<li>Experience in working with both unstructured and structured data</li>\n<li>A solid foundation in computer science, with strong competencies in data structures, algorithms and software design</li>\n<li>Ability to apply software techniques to the development of real world engineering solutions\nExperience with one or more of the following technologies in each category:</li>\n<li>MongoDB (NoSQL), Hadoop, InfluxDB, Postgres, MS SQL, OSIsoft;\n*Kafka, Spark, Power BI, Tableau, Grafana;\n*C/C++, VB/C#, Python, Java/Scala/Kotlin, Node.js/JavaScript/TypeScript;\n*Version control systems (e.g. Git, SVN, Mercurial, etc.);\n*Project management software (e.g. Jira, Confluence);\n*Unix based and Windows operating systems;</li>\n<li>Prior experience in design/development of enterprise-scale solutions involving large scale data and BI visualization technologies</li>\n<li>Detail oriented with a keen focus on User Experience (Ux) and customer satisfaction.</li>\n<li>Familiarity and prior experience with Agile / Scrum development methodologies</li>\n<li>Multi core / machine development experience (Linux and Windows)</li>\n<li>Experience with developing scalable / parallel processing applications</li>\n<li>High level of interpersonal skills to work independently and effectively with others</li>\n<li>Exceptional skills related to time management and decision making</li>\n<li>Willingness to travel to support customer projects and implementations</li>\n<li>Good communication skills, both verbal and written</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"mailto:vacancies@ncodefederal.com\">vacancies@ncodefederal.com</a></p>\n",
      "company_logo": null
    },
    {
      "id": "7d84945b-893d-493e-957a-4ed9e6f84607",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/7d84945b-893d-493e-957a-4ed9e6f84607",
      "created_at": "Thu Jul 30 12:02:59 UTC 2020",
      "company": "HBM nCode Federal LLC",
      "company_url": "http://www.hbmprenscia.com",
      "location": "Southfield, MI",
      "title": "Software Engineer",
      "description": "<p>HBM nCode Federal LLC/Prenscia Engineering Solutions is looking for a talented Software Engineer to join our fast growing team in our Southfield, MI office. You will be joining an active, dynamic and growing software design, development and configuration team to rapidly create innovative digital software solutions. This includes working with a team alongside subject matter experts, project managers and product managers to deliver innovative solutions using the latest technology and approaches.</p>\n<p>RESPONSIBILITIES:</p>\n<ul>\n<li>Software product configuration, design and implementation</li>\n<li>Assist the principal software engineer in collaborating with our Subject Matter Experts to understand and convert user requirements into digital design solutions based on customer (and market) needs</li>\n<li>Create detailed documentation for digital solutions, custom solutions and products and assist in customer and partner implementations</li>\n<li>Collaborate with our wider organizational software development and configuration teams to share lessons learned regarding these activities to help future solutions and software products plus ensure consistency</li>\n<li>Work with project and product managers to achieve on-time, on-cost delivery</li>\n<li>Research and test new technologies and software plus identify and recommend their applicability</li>\n<li>Presentations to team members, management and customers</li>\n</ul>\n<p>EDUCATION / CERTIFICATIONS:</p>\n<ul>\n<li>A Bachelor or Master’s degree in Computer Engineering or Computer Science with an engineering background.</li>\n<li>A minimum of 3 years of relevant experience and related technology professional certifications</li>\n</ul>\n<p>PERSONAL SKILLS/EXPERIENCES:</p>\n<ul>\n<li>US Citizens Only (REQUIREMENT)</li>\n<li>Solid understanding of Object Oriented Programming</li>\n<li>Solid understanding of modern Web based Programming techniques</li>\n<li>Experience with database architectures, scripting and web services</li>\n<li>Experience in working with both unstructured and structured data</li>\n<li>A solid foundation in computer science, with strong competencies in data structures, algorithms and software design</li>\n<li>Ability to apply software techniques to the development of real world engineering solutions</li>\n<li>Experience with one or more of the following technologies in each category:\nMongoDB (NoSQL), Hadoop, InfluxDB, Postgres, MS SQL, OSIsoft;\nKafka, Spark, Power BI, Tableau, Grafana;\nC/C++, VB/C#, Python, Java/Scala/Kotlin, Node.js/JavaScript/TypeScript;\nVersion control systems (e.g. Git, SVN, Mercurial, etc.);\nProject management software (e.g. Jira, Confluence);\nUnix based and Windows operating systems</li>\n<li>Prior experience in design/development of enterprise-scale solutions involving large scale data and BI visualization technologies</li>\n<li>Detail oriented with a keen focus on User Experience (Ux) and customer satisfaction.</li>\n<li>Familiarity and prior experience with Agile / Scrum development methodologies</li>\n<li>Multi core / machine development experience (Linux and Windows)</li>\n<li>Experience with developing scalable / parallel processing applications</li>\n<li>High level of interpersonal skills to work independently and effectively with others</li>\n<li>Exceptional skills related to time management and decision making</li>\n<li>Willingness to travel to support customer projects and implementations</li>\n<li>Good communication skills, both verbal and written</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"mailto:vacancies@ncodefederal.com\">vacancies@ncodefederal.com</a></p>\n",
      "company_logo": null
    },
    {
      "id": "9a05af9c-9f58-41f7-b0a0-3890fb75dd85",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/9a05af9c-9f58-41f7-b0a0-3890fb75dd85",
      "created_at": "Tue Jul 28 14:19:46 UTC 2020",
      "company": "General Motors",
      "company_url": null,
      "location": "Warren, Michigan",
      "title": "Entry Level Controls and Software Engineer ",
      "description": "<p>About GM\nThere’s never been a more exciting time to work for General Motors.</p>\n<p>To achieve our vision of a world with Zero Crashes, Zero Emissions and Zero Congestion, we need people to join us who are passionate about creating safer, better and more sustainable ways for people to get around. This bold vision won’t happen overnight, but just as we transformed how the world moved in the last century, we are committed to transforming how we move today and in the future.</p>\n<p>Why Work for Us\nOur culture is focused on building inclusive teams, where differences and unique perspectives are embraced so you can contribute to your fullest potential as you pursue your career. Our locations feature a variety of work environments, including open work spaces and virtual connection platforms to inspire productivity and flexible collaboration. And we are proud to support our employees volunteer interests, and make it a priority to join together in efforts that give back to our communities.</p>\n<p>Job Description\nGeneral Motors is looking for innovative Entry Level Cyber-Physical Systems Engineers to help us build state-of-the-art platforms. This rotational opportunity is an early career development initiative for new hires designed to build foundational skills, to gain greater exposure and to better understand our business. This role aims to develop and strengthen the future of our organization through rotational development, networking and annual development opportunities. This program requires a two-year commitment and consists of 4 six-month assignments. Upon completion of the program, participants are matched to opportunities based on interest and business needs.</p>\n<p>In this entry level rotational opportunity, you will help design, develop and test software codes, algorithms, embedded systems and architect software to optimize controller resources and throughput.  These codes will run throughout almost every aspect of the vehicle controllers so you will be able to do hands on work that can directly affect the vehicle. Your work could be driving around on the roads! All of this work will be done on multiple levels so you will have a chance to develop interpersonal and relationship management skills with the ability to effectively collaborate with varying levels of the organization.</p>\n<p>Primary responsibilities:\nConvert/interpret algorithms and other required documents into software code\nAccountable to develop software that runs within GM’s embedded controllers using the GM software tool chain\nDesign, develop and test feature behavior and interaction between controls hardware and controls software\nDevelop test cases aligned with requirements using manual and automated test environments in the local PC, Hardware-In-the-Loop (HIL) bench, and system level bench environments\nCompile software into executable files and to test/evaluate executable files\nData analysis and research to assess vehicle feature feasibility\nAdditional Job DescriptionQualifications:\nCurrently pursuing a Bachelor’s Degree or Master’s Degree in the following fields of study: Computer Engineering, Software Engineering, Computer Science, Controls Engineering, Controls Systems Engineering, or Mechatronics\nMust be graduating between October 2020 and June 2021</p>\n<p>ABET accredited program Preferred\nMust have a minimum of a 3.0 cumulative GPA on a 4.0 scale\nDemonstrated coding efficiency, speed &amp; quality\nEfficient use of MATLAB/Simulink\nDesired Skills:\nPrior internship experience in automotive or technology\nEngineering degree with focus on Robotics, Data Analytics, Machine Learning, Sensing, Automation, or Computation\nExperience with programming languages Ex: Python, C++, Java, etc.\nDemonstrated algorithm generation and connection to the physical requirements\nSoftware Programs: CAN messaging, GIT change management tool, Rhapsody, DOORS Requirements management software\nDemonstrated knowledge and application of Software and/or Controls Engineering Principles\nExcellent written and verbal communication skills with the ability to distill sophisticated subjects to a wider audience\nEmerging partnership and teamwork skills and ability to learn from and share knowledge with co-workers in a rapidly moving environment\nHigh level of integrity, ability to deal with ambiguity, takes initiative/self-directed\nEvidence of strong character with integrity, honesty, accountability and trust\nDeliver new and creative solutions to complex problems\nRelocation assistance is available to candidates who meet eligibility requirements.</p>\n<p>PLEASE ONLY APPLY IF YOU DO NOT NEED SPONSORSHIP TO WORK IN THE UNITED STATES NOW OR IN THE FUTURE. WE ARE UNABLE TO CONSIDER CANDIDATES WHO REQUIRE SPONSORSHIP.</p>\n<p>Diversity Information\nGeneral Motors is committed to being a workplace that is not only free of discrimination, but one that genuinely fosters inclusion and belonging. We strongly believe that workforce diversity creates an environment in which our employees can thrive and develop better products for our customers. We understand and embrace the variety through which people gain experiences whether through professional, personal, educational, or volunteer opportunities.</p>\n<p>We encourage interested candidates to review the key responsibilities and qualifications and apply for any positions that match your skills and capabilities.</p>\n",
      "how_to_apply": "<p>Join our General Motors Team! Apply here: <a href=\"https://search-careers.gm.com/job/GENEA0084JR000005751ENUS/Entry-Level-Controls-and-Software-Engineer-Global-Product-Group\">https://search-careers.gm.com/job/GENEA0084JR000005751ENUS/Entry-Level-Controls-and-Software-Engineer-Global-Product-Group</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczJHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--97a0aab03f74a44cfd5b07ca3c85493fa88ee247/GM_Logo.png"
    },
    {
      "id": "0e8f447e-9f83-4257-921c-532f29ebfa63",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/0e8f447e-9f83-4257-921c-532f29ebfa63",
      "created_at": "Mon Jul 27 10:37:11 UTC 2020",
      "company": "Reveela Technolgies Limited",
      "company_url": "http://www.reveela.com",
      "location": "Newcastle",
      "title": "Data Scientist & Machine Learning Engineer ",
      "description": "<p>Role: Data Scientist &amp; Machine Learning Engineer\nLocation: Newcastle Upon Tyne\nSalary: £30,000-£36,000 per annum depending upon specialisms</p>\n<p>Working as part of an agile team, you will be involved in expanding and developing advanced methodologies &amp; data analytics for a next generation publishing ecosystem that facilitates collaboration between Publishers, Journalists and the Business Community by applying artificial intelligence (Natural Language Processing) and machine learning. Further background can be sought here: <a href=\"https://vimeo.com/371641177\">https://vimeo.com/371641177</a></p>\n<p>Given the project involves behaviour analysis, as well as a large amount of data analysis, modelling of decision making and data interpretation; an ability to critically interpret results and experience of experimentation, modelling and data analysis is essential.</p>\n<p>Key areas of responsibility will include:</p>\n<ul>\n<li>Building &amp; optimizing a range of complex classifiers using machine learning &amp; statistical techniques.</li>\n<li>Collaborate with other system engineers to build data and model pipelines</li>\n<li>Manage the infrastructure and data pipelines needed to bring code to production</li>\n<li>Demonstrate end-to-end understanding of applications (including, but not limited to, the machine learning algorithms) being created</li>\n<li>Build algorithms based on statistical modelling procedures and build and maintain scalable machine learning solutions in production</li>\n<li>Use data modelling and evaluation strategy to find patterns and predict unseen instances</li>\n<li>Apply machine learning algorithms and libraries</li>\n<li>Lead on software engineering and software design with UX team.</li>\n<li>Communicate and explain complex processes to stakeholders who are not programming experts</li>\n<li>Liaise with stakeholders to analyse business problems, clarify requirements and define the scope of the resolution needed</li>\n<li>Analyse expansive, complex datasets to extract insights and decide on the appropriate technique</li>\n<li>Research and implement best practices to improve the existing machine learning infrastructure</li>\n<li>Provide support to engineers and product managers in implementing machine learning in the product.</li>\n<li>You'll be working with multifaceted systems, requiring you to have a high level of concentration and attention to detail.</li>\n<li>Testing and evaluating data mining models to select the most appropriate ones for any context.</li>\n<li>Handling systems architecture with cloud technologies (AWS, Azure, Google Cloud, IBM Cloud)</li>\n</ul>\n<p>Skills, Experience and Education Required</p>\n<ul>\n<li>A PhD in Computer Science, Software Engineering, or closely related discipline is needed for this interdisciplinary job role.</li>\n<li>Experience of using both MySQL and No SQL databases (MongoDB/Elastic Search)</li>\n<li>Highly competent in using Python</li>\n<li>Experience of exploratory data analysis</li>\n<li>The ability to work within a highly skilled team, adding value through idea generation &amp; implementation.</li>\n<li>Must be proactive about technology horizon scanning and willing to go the extra make to make a difference to the world through the real-world application of technological solutions.</li>\n</ul>\n<p>Additional Details</p>\n<p>Exceptional fun working environment\n25 days annual holiday\nAttractive benefits package Including Health insurance\nNOTE: Applicants MUST have a valid UK visa</p>\n",
      "how_to_apply": "<p>E mail your CV to <a href=\"mailto:john@reveela.com\">john@reveela.com</a> or <a href=\"mailto:john.graham@distinctivegroup.co.uk\">john.graham@distinctivegroup.co.uk</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXlHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--13e8ad5220882e02b0092a98dde37872388bf6a0/ReveelaLogoGrey%20(002).png"
    },
    {
      "id": "f95c5fdd-749d-441a-8497-35bf430ac7b5",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/f95c5fdd-749d-441a-8497-35bf430ac7b5",
      "created_at": "Fri Jul 24 18:02:37 UTC 2020",
      "company": "General Atomics",
      "company_url": "https://www.ga-careers.com/",
      "location": "Centennial, CO",
      "title": "Flight Software Developer",
      "description": "<p>General Atomics (GA), and its affiliated companies, is one of the world’s leading resources for high-technology systems development ranging from the nuclear fuel cycle to remotely piloted aircraft, airborne sensors, and advanced electric, electronic, wireless and laser technologies.</p>\n<p>General Atomics Electromagnetic Systems (GA-EMS) designs and manufactures first-of-a-kind electromagnetic and electric power generation systems. GA-EMS’ expanding portfolio of specialized products and integrated system solutions support critical fleet, space systems and satellites, missile defense, power and energy, and process and monitoring applications for defense, industrial, and commercial customers worldwide.</p>\n<p>We currently have an exciting opportunity for a Flight Software Developer working on satellite systems to join our team located in Centennial, CO.</p>\n<p>DUTIES AND RESPONSIBILITIES:</p>\n<ul>\n<li>Develop flight software, interface software and drivers for satellite systems</li>\n<li>Perform ground segment (satellite operations) software architecture design as part of the overall satellite system solution.</li>\n<li>Perform all aspects of the software development lifecycle including requirements definition, software design, development, test, debug and documentation.</li>\n<li>Design, develop and verify test software and simulation capability.</li>\n<li>Troubleshoot system anomalies related to software, system configuration, network interfaces and operating system issues.</li>\n<li>Support functional and performance testing of equipment, subsystems and systems in support of satellite assembly, integration and test.</li>\n<li>Apply technical knowledge to analyze, investigate and resolve engineering problems, including future applications, and engineering developments.</li>\n<li>Prepare technical responses to bids, presentation materials and reports, for a variety of applications and customers.</li>\n<li>Support and actively participate in customer and supplier meetings and presentations at all project stages.</li>\n<li>Liaise with customer and supplier staff, and staff from other parts of GA.</li>\n<li>Perform other duties as assigned or required.\nWe recognize and appreciate the value and contributions of individuals with diverse backgrounds and experiences and welcome all qualified individuals to apply.</li>\n</ul>\n<p>JOB QUALIFICATIONS:</p>\n<ul>\n<li>\n<p>Typically requires a bachelors degree, masters degree or PhD in computer science, information systems or a related discipline and progressive software development experience as follows; four or more years of experience with a bachelors degree or two or more years of experience with a masters degree. May substitute equivalent experience in lieu of education.</p>\n</li>\n<li>\n<p>Must have a complete understanding of software development concepts, principles, and theory and demonstrate complete understanding and application of programming and analysis concepts.</p>\n</li>\n<li>\n<p>Must possess the ability to understand new concepts quickly and apply them accurately throughout an evolving environment.</p>\n</li>\n<li>\n<p>Ability to organize, schedule, and coordinate work phases and, determine the appropriate approach at the task level or, with assistance, at the project level and to provide solutions to a range of complex problems.</p>\n</li>\n<li>\n<p>Ability to obtain and maintain a DoD Security Clearance is required.</p>\n</li>\n<li>\n<p>Experience with C/C++, Python, Real Time Operating Systems, embedded systems, Linux, Microsoft Windows, IP communications and networking is desired.</p>\n</li>\n<li>\n<p>Experience with MySQL, VHDL, windows registry, knowledge of Cisco Routers would be beneficial.</p>\n</li>\n<li>\n<p>Familiarity with GIT.</p>\n</li>\n<li>\n<p>Demonstrated experience on satellite software products or safety critical software is an advantage.</p>\n</li>\n<li>\n<p>Familiarity with all aspects of the satellite system life cycle is desired.</p>\n</li>\n<li>\n<p>Understanding of clean room compliance and safe working practices.</p>\n</li>\n<li>\n<p>Strong communication, computer, documentation, presentation, and interpersonal skills are required, as well as the ability to work both independently and as part of a team.</p>\n</li>\n<li>\n<p>Must be able to work extended hours as required and be flexible and adaptable to changing priorities and workloads.</p>\n</li>\n<li>\n<p>US citizenship is required.</p>\n</li>\n<li>\n<p>Travel Percentage Required 0% - 25%</p>\n</li>\n<li>\n<p>US Citizenship Required? Yes</p>\n</li>\n<li>\n<p>Clearance Required? No</p>\n</li>\n</ul>\n",
      "how_to_apply": "<p><a href=\"https://bit.ly/39n8ZES\">https://bit.ly/39n8ZES</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGVHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fc9a2e7c96f85e344b9a29da5fb01a261791ebe2/GA%20icon%20logo.png"
    },
    {
      "id": "fd0163dc-0edb-4be6-aec0-1b39653a2ff3",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/fd0163dc-0edb-4be6-aec0-1b39653a2ff3",
      "created_at": "Fri Jul 24 15:11:00 UTC 2020",
      "company": "Thermondo GmbH",
      "company_url": "https://www.thermondo.de/",
      "location": "Berlin",
      "title": "(Senior) Python Developer / Software Engineer (m/f/d)",
      "description": "<p>Wir bauen mit Thermondo ein besonderes Unternehmen. Wir sind der klare Innovator und First-Mover in unserem Markt. Wir haben starke Gesellschafter und sind gut finanziert. Wir sind ein dynamisches Startup mit starkem Wachstum. Bei uns findest Du ein tolles Arbeitsumfeld in einer besonderen Unternehmenskultur, in der Dein Talent und Deine Persönlichkeit einen Platz finden. In flachen Strukturen arbeitet bei uns ein aufgeschlossenes und motiviertes Team. Wir sind alle mit Leidenschaft dabei, erwarten dasselbe von Dir und freuen uns auf Deine Unterstützung.</p>\n<p><strong>We're looking for</strong></p>\n<p>... a (Senior) Python Developer / Software Engineer (m/f/d) in Berlin who will join our international tech team as soon as possible in creating one of the fastest growing companies in the heating market.</p>\n<p><strong>About us</strong></p>\n<p>Thermondo was founded in 2012 to advance the energy revolution with innovative heating solutions. More than 16,000 heating-system transformations later, we are not only No. 1 in heating system construction, but have also made a lasting difference to the heating market. We are the pioneer and innovation leader in the digitalisation of the trade. The basis for this is the resourceful teamwork of our tech, marketing, sales, development, IT and HR experts. With passion and verve, they fulfill our vision of &lt;2° (less than two degrees).</p>\n<p><strong>What we offer</strong></p>\n<ul>\n<li>Full time or part time, permanent contract.</li>\n<li>Plenty of opportunities for new ideas and responsibilities.</li>\n<li>Any tech equipment you need (Mac/Linux/Windows).</li>\n<li>Flexible working hours and a professional development environment.</li>\n<li>The possibility to work 3 days a week in your mobile office.</li>\n<li>An international team, team-building events and 30 days of vacation.</li>\n<li>Your work has a direct impact on the German energy market.</li>\n<li>Regular feedback as an integral part of employee development (e. g. paid educational leave, conference budget etc.).</li>\n</ul>\n<p><strong>Our stack</strong></p>\n<p>We are mainly using Python along with Django or Wagtail connected to PostgreSQL. We also have some JavaScript applications written in Typescript using ReactJS.  You even find some exotic things like LaTeX in our stack.\nMost of our hosting is done on Heroku. We’re trying to make use of a lot of Heroku’s tools like pipelines, backups, buildpacks and some monitoring plugins. We try to keep DevOps work to a minimum since we want to focus on building and shipping functionality. We are using some AWS services like S3.</p>\n<p><strong>Your tasks</strong></p>\n<p>Our Python based backend is the backbone of our Germany wide operation and key to the digitization of the energy business. It’s an enterprise-grade application which connects our own services to third party platforms like Salesforce.</p>\n<p>Our business is constantly growing and changing. New feature requests or requirement changes may emerge every day. As a result we build software that is highly maintainable to satisfy those needs. Your job will be to work in small teams on independent projects alongside your non technical colleagues. You will analyze our business needs and implement solutions while maintaining a high quality standard and developing at startup speed. You will have the freedom to use any tools and resources to achieve your goals. Our team of more than ten experienced engineers will support you to reach your full potential. For more information visit: <a href=\"http://t3u1.mjt.lu/lnk/AUgAAAf06nMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBfGt9gqIsxRLCkSoi9-mTTpiJ8nAAGCXo/2/ou_CfSrhP8Oa6LWPKirzcg/aHR0cHM6Ly90aGVybW9uZG8uZ2l0aHViLmlvLw\">https://thermondo.github.io</a></p>\n<p><strong>Your profile</strong></p>\n<ul>\n<li>University degree in a technical field, or a comparable qualification</li>\n<li>Relevant experience in programming and web technology</li>\n<li>Very good understanding of back-end technologies – Python or JavaScript</li>\n<li>Familiar in working with frameworks like Django or Celery</li>\n<li>Experience with Heroku is a plus</li>\n<li>Knowledge of version control systems - Git or SVN</li>\n<li>Experience with agile methodologies - Kanban, Scrum or similar</li>\n<li>Fluency in English. German skills are a plus but not important for this position</li>\n</ul>\n<p><strong>It's on</strong></p>\n<p>That's exactly the challenge you're looking for? We look forward to getting to know you!</p>\n<p><img src=\"https://camo.githubusercontent.com/4808bade5b7e7e7006ab2c9a5f42c0838053d524/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f62353462646134636437643833616436393032306336663761326161353331373730636261616134376132396365376332363236653234376635393732316663\"></p>\n",
      "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/h/9b36c340c50b432432aa6dfb9a41a8f8b08fbebdecd92c30697015c4b7218e22\">application form</a></p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbytHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb3d7320d68717a67d97e9e068b6e4449bba9bbe/Thermondo%20GmbH.png"
    },
    {
      "id": "251e10e9-d5c4-44be-8dc5-e30507022af1",
      "type": "Full Time",
      "url": "https://jobs.github.com/positions/251e10e9-d5c4-44be-8dc5-e30507022af1",
      "created_at": "Thu Jul 23 14:55:34 UTC 2020",
      "company": "Phalanx Software Ltd.",
      "company_url": "https://phalanx.software/careers/software-developer",
      "location": "Malta",
      "title": "Software Developer",
      "description": "<p>Phalanx Software are looking for a Software Developer proficient in either <strong>Java</strong> or <strong>Python</strong>, and with at least\ntwo years of experience in the industry, to join the team.</p>\n<h3>At a Glance</h3>\n<ul>\n<li>\n<strong>Role:</strong> Software Developer</li>\n<li>\n<strong>Basis:</strong> Full-time</li>\n<li>\n<strong>Languages:</strong> Either Java or Python</li>\n<li>\n<strong>Experiance Required:</strong> 2 years</li>\n<li>\n<strong>Location:</strong> Remotely but must live in Malta/Gozo</li>\n<li>\n<strong>Salary:</strong> €30,000 per annum</li>\n</ul>\n<h3>About Us</h3>\n<p>Phalanx Software is a new company, founded in 2019 and based in Malta, specializing in iGaming and enterprise software. Quality and\nprofessionalism are the company’s core values. We aim to build software that solves the complex problems that\nbusinesses face as they transition out of their startup phases and start looking to automate their business processes.</p>\n<p>Phalanx Software is led by Kyle Pullicino, a software developer with a Masters in Computer Science. Kyle has been working\nin the iGaming and financial services industry for over five years. He has seen how inefficient these enterprises can\nget as they grow and Phalanx Software’s mission is based on tackling these problems widespread throughout the industry.</p>\n<h3>Requirements</h3>\n<p>Applicants must:</p>\n<ul>\n<li>be proficient in either <strong>Java</strong> or <strong>Python</strong> and their ecosystems;</li>\n<li>have been working as a software developer for <strong>at least two years</strong>;</li>\n<li>be comfortable using <strong>Linux-based systems</strong>;</li>\n<li>understand the <strong>principles of good software design</strong>;</li>\n<li>use a <strong>pragmatic approach</strong> when building software;</li>\n<li>be <strong>willing to learn</strong> and truly understand the business domains that we work in; and,</li>\n<li>live in <strong>Malta or Gozo</strong>.</li>\n</ul>\n<h3>The Role</h3>\n<p>As a software developer, the chosen applicant will be responsible for understanding the requirements presented to us by\nour clients, design solutions tackling those problems and then develop, test and deploy the required software\napplications.</p>\n<p>Since Phalanx Software is a new company, the chosen applicant will also have the unique opportunity of\nhelping the company grow. In particular, they will have a say on the company’s overall software development process, the\ntools that we use and how we conduct our business in general. The chosen applicant will be required to <strong>work remotely</strong>\nfrom their home and the company will grant the employee help with setting up their home office.</p>\n<p><em>The budgeted gross salary for this role is of €30,000 per annum and the chosen applicant is expected to work 32 hours\nper week on a full-time basis.</em></p>\n",
      "how_to_apply": "<p>If you fit the bill, we'd love to hear from you! Apply by sending your CV and a short introduction of yourself to\n<a href=\"mailto:careers@phalanx.software\">careers@phalanx.software</a> and we'll get back to you.</p>\n",
      "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2lHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b186751a3a37f9a2a06e451fa34d224aa02e2e67/logo.png"
    }
  ]
}